app/controllers/items_controller.rb

INSERT INTO "items" ("name", "done", "todo_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Visit Narnia"], ["done", 0], ["todo_id", 1], ["created_at", "2019-07-23 02:33:03.793633"], ["updated_at", "2019-07-23 02:33:03.793633"]]
---
  def create
    @todo.items.create!(item_params)

UPDATE "items" SET "name" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["name", "Mozart"], ["updated_at", "2019-07-23 02:33:04.112576"], ["id", 1]]
---
  def update
    @item.update(item_params)

SELECT  "items".* FROM "items" WHERE "items"."todo_id" = ? AND "items"."id" = ? LIMIT ?  [["todo_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def set_todo_item
    @item = @todo.items.find_by!(id: params[:id]) if @todo